#### Terraform fmt for dev `success`
#### Terraform init for dev `success`
#### Terraform validate for dev `success`
#### Terraform plan for dev `success`

<details><summary>Show plan result for dev </summary>

```

provision
random_password.vm_password: Refreshing state... [id=none]
proxmox_virtual_environment_download_file.debian_12_cloud_image: Refreshing state... [id=local:iso/debian_12_cloud_image.img]
proxmox_virtual_environment_vm.dev_vm: Refreshing state... [id=100]
proxmox_virtual_environment_vm.test_vm: Refreshing state... [id=101]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.dev_vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "dev_vm" {
        id                      = "100"
        name                    = "dev"
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ ssd               = false -> true
            # (8 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.test_vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "test_vm" {
      ~ id                      = "101" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [] -> (known after apply)
        name                    = "test-vm"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      - tags                    = [] -> null
      ~ vm_id                   = 101 -> (known after apply)
        # (19 unchanged attributes hidden)

      + disk {
          + cache             = "none"
          + datastore_id      = "local-zfs"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = "local:iso/debian_12_cloud_image.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 100
          + ssd               = false
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with proxmox_virtual_environment_vm.dev_vm,
  on debian.tf line 106, in resource "proxmox_virtual_environment_vm" "dev_vm":
 106:       server = "192.168.${var.tag}.1"

The `server` attribute is deprecated and will be removed in a future release.
Please use the `servers` attribute instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*